app/views/users/new.html.erb

SELECT "cities".* FROM "cities"
---
    <%= label_tag 'user[city]', 'Où habitez-vous ?' %>
    <%= collection_select(:user, :city_id, City.all, :id, :name, { prompt: 'Sélectionnez une ville' }, class: 'form-control') %>