app/views/gossips/index.html.erb

  <div class="row">
    <% Gossip.all.each do |gossip| %>
---
SELECT "gossips".* FROM "gossips"

            <h5 class="card-title"><%= gossip.title %></h5>
            <h6 class="card-subtitle mb-2 text-muted"><%= gossip.user.first_name %></h6>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]