app/views/home/home.html.erb

SELECT "gossips".* FROM "gossips" ORDER BY "gossips"."created_at" DESC LIMIT $1  [["LIMIT", 10]]
---
  <div class="row row-cols-1 row-cols-md-3 g-4">
    <% Gossip.order(created_at: :desc).limit(10).each do |gossip| %>