app/views/home/home.html.erb

SELECT "gossips".* FROM "gossips" ORDER BY "gossips"."created_at" DESC LIMIT $1  [["LIMIT", 5]]
---
  <div class="row">
    <% Gossip.order(created_at: :desc).limit(5).each do |gossip| %>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]
---
            <h5 class="card-title"><%= gossip.title %></h5>
            <h6 class="card-subtitle mb-2 text-muted"><%= gossip.user.first_name %></h6>