app/controllers/cities_controller.rb

   def show
     @city = City.find(params[:id])
     @users = @city.users
     @gossips = Gossip.joins(:user).where(users: { city_id: @city.id })
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips" INNER JOIN "users" ON "users"."id" = "gossips"."user_id" WHERE "users"."city_id" = $1  [["city_id", 33]]