app/controllers/comments_controller.rb

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 83], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "gossip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", nil], ["user_id", 32], ["gossip_id", 60], ["created_at", "2023-11-02 15:47:13.594664"], ["updated_at", "2023-11-02 15:47:13.594664"]]
---
def create
  nelly_guerin = User.find_by(first_name: "Nelly", last_name: "Guerin")
  @gossip = Gossip.find(params[:gossip_id])
  @comment = @gossip.comments.build(content: params[:comment][:content], user: nelly_guerin)

  if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 188], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 191]]
---
def destroy
  # Méthode qui récupère le potin concerné et le détruit en base
  # Une fois la suppression faite, on redirige généralement vers la méthode index (pour afficher la liste à jour)
  @comment = Comment.find_by(id: params[:id])
  @comment.destroy