app/controllers/gossips_controller.rb

  def show
    @gossip = Gossip.find(params[:id])
    @comments = @gossip.comments
    @comment_count = @comments.count
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 81]]

  def create
    @gossip = Gossip.new(content: params[:content], title: params[:title], user: current_user)
    puts @gossip.title
    if @gossip.save
---
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def edit
    # Méthode qui récupère le potin concerné et l'envoie à la view edit (edit.html.erb) pour affichage dans un formulaire d'édition
    @gossip = Gossip.find(params[:id])
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 84], ["LIMIT", 1]]

  def update
    # Méthode qui met à jour le potin à partir du contenu du formulaire de edit.html.erb, soumis par l'utilisateur
    # pour info, le contenu de ce formulaire sera accessible dans le hash params
    # Une fois la modification faite, on redirige généralement vers la méthode show (pour afficher le potin modifié)
    @gossip = Gossip.find(params[:id])
    gossip_params = params.require(:gossip).permit(:title, :content)

    if @gossip.update(gossip_params)
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 84], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["content", "Bah alors ?! on n'attend pas patrick ? "], ["updated_at", "2023-11-03 14:59:16.025154"], ["id", 87]]

  def destroy
    # Méthode qui récupère le potin concerné et le détruit en base
    # Une fois la suppression faite, on redirige généralement vers la méthode index (pour afficher la liste à jour)
    @gossip = Gossip.find_by(id: params[:id])
    @gossip.destroy
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 30]]