app/controllers/gossips_controller.rb

  def create
    nelly_guerin = User.find_by(first_name: "Nelly", last_name: "Guerin")
---
SELECT "users".* FROM "users" WHERE "users"."first_name" = $1 AND "users"."last_name" = $2 LIMIT $3  [["first_name", "Nelly"], ["last_name", "Guerin"], ["LIMIT", 1]]