app/controllers/sessions_controller.rb

  def create
    # Récupérez l'email et le mot de passe depuis les paramètres du formulaire
    email = params[:email]
    password = params[:password]

    # Recherchez un utilisateur en fonction de l'email
    user = User.find_by(email: email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "nelly.guerin@email.com"], ["LIMIT", 1]]