app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" = $1  [["user_id", 31]]
---
  def show
    @user = User.find(params[:id])
    @gossips = @user.gossips if @user.gossips.present?

SELECT "cities".* FROM "cities" WHERE "cities"."name" = $1 AND "cities"."zip_code" = $2 LIMIT $3  [["name", "Paris"], ["zip_code", "75011"], ["LIMIT", 1]]
INSERT INTO "users" ("first_name", "last_name", "description", "email", "age", "city_id", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(user_params)

      # par defaut tous les nouveaux user sont a paris. Recherche de la ville de Paris ou création si elle n'existe pas
    paris_city = City.find_or_create_by(name: "Paris", zip_code: "75011")
    @user.city = paris_city

    if @user.save