app/models/user.rb

  def remember(remember_token)
    remember_digest = BCrypt::Password.create(remember_token)
    self.update(remember_digest: remember_digest)
---
UPDATE "users" SET "updated_at" = $1, "remember_digest" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-11-03 14:05:02.900654"], ["remember_digest", "$2a$12$w05ZsR6Hp9Fbu7i7NTMmDuQz1C2proxAql6V7pF32GYMx/lO0zdyC"], ["id", 52]]